## Reading DataFrames from multiple files

When data is spread among several files, you usually invoke pandas' read_csv() (or a similar data import function) multiple times to load the data into several DataFrames.

The data files for this example have been derived from a list of Olympic medals awarded between 1896 & 2008 compiled by the Guardian.

The column labels of each DataFrame are NOC, Country, & Total where NOC is a three-letter code for the name of the country and Total is the number of medals of that type won (bronze, silver, or gold).

In [36]:
# Import pandas
import pandas as pd

path = 'K:\\TensorflowPY36CPU\\TensorflowPY36CPU\\_1_PythonBasic\\Pandas\\'

# Read 'Bronze.csv' into a DataFrame: bronze
bronze = pd.read_csv('K:\\TensorflowPY36CPU\\TensorflowPY36CPU\\_1_PythonBasic\\Pandas\\Bronze.csv')

# Read 'Silver.csv' into a DataFrame: silver
silver = pd.read_csv('K:\\TensorflowPY36CPU\\TensorflowPY36CPU\\_1_PythonBasic\\Pandas\\Silver.csv')

# Read 'Gold.csv' into a DataFrame: gold
gold = pd.read_csv('K:\\TensorflowPY36CPU\\TensorflowPY36CPU\\_1_PythonBasic\\Pandas\\Gold.csv')

# Print the first five rows of gold
print(gold.head())

   NOC         Country   Total
0  USA   United States  2088.0
1  URS    Soviet Union   838.0
2  GBR  United Kingdom   498.0
3  FRA          France   378.0
4  GER         Germany   407.0

## Reading DataFrames from multiple files in a loop
As you saw in the video, loading data from multiple files into DataFrames is more efficient in a loop or a list comprehension.

Notice that this approach is not restricted to working with CSV files. That is, even if your data comes in other formats, as long as pandas has a suitable data import function, you can apply a loop or comprehension to generate a list of DataFrames imported from the source files.

Here, you'll continue working with The Guardian's Olympic medal dataset.

In [5]:
# Create the list of file names: filenames
filenames = ['K:\\TensorflowPY36CPU\\TensorflowPY36CPU\\_1_PythonBasic\\Pandas\\Gold.csv', 'K:\\TensorflowPY36CPU\\TensorflowPY36CPU\\_1_PythonBasic\\Pandas\\Silver.csv', 'K:\\TensorflowPY36CPU\\TensorflowPY36CPU\\_1_PythonBasic\\Pandas\\Bronze.csv']

# Create the list of three DataFrames: dataframes
dataframes = []
for filename in filenames:
    dataframes.append(pd.read_csv(filename))

# Print top 5 rows of 1st DataFrame in dataframes
print(dataframes[0].head())

   NOC         Country   Total
0  USA   United States  2088.0
1  URS    Soviet Union   838.0
2  GBR  United Kingdom   498.0
3  FRA          France   378.0
4  GER         Germany   407.0

## Combining DataFrames from multiple data files
In this exercise, you'll combine the three DataFrames from earlier exercises - gold, silver, & bronze - into a single DataFrame called medals. The approach you'll use here is clumsy. Later on in the course, you'll see various powerful methods that are frequently used in practice for concatenating or merging DataFrames.

Remember, the column labels of each DataFrame are NOC, Country, and Total, where NOC is a three-letter code for the name of the country and Total is the number of medals of that type won.

In [6]:
# Make a copy of gold: medals
medals = gold.copy()

# Create list of new column labels: new_labels
new_labels = ['NOC', 'Country', 'Gold']

# Rename the columns of medals using new_labels
medals.columns = new_labels

# Add columns 'Silver' & 'Bronze' to medals
medals['Silver'] = silver['Total'] 
medals['Bronze'] = bronze['Total']

# Print the head of medals
print(medals.head())

   NOC         Country    Gold  Silver  Bronze
0  USA   United States  2088.0  1195.0  1052.0
1  URS    Soviet Union   838.0   627.0   584.0
2  GBR  United Kingdom   498.0   591.0   505.0
3  FRA          France   378.0   461.0   475.0
4  GER         Germany   407.0   350.0   454.0

## using Listing Comprehehension

In [7]:
dataframe2 = pd.concat([pd.read_csv(f) for f in filenames])
dataframe2.equals(dataframes)

False

# using Glob modules

In [11]:
from glob import glob
filesnames = glob('sales*.csv')

In [12]:
filenames

['K:\\TensorflowPY36CPU\\TensorflowPY36CPU\\_1_PythonBasic\\Pandas\\Gold.csv',
 'K:\\TensorflowPY36CPU\\TensorflowPY36CPU\\_1_PythonBasic\\Pandas\\Silver.csv',
 'K:\\TensorflowPY36CPU\\TensorflowPY36CPU\\_1_PythonBasic\\Pandas\\Bronze.csv']

In [13]:
globadf = pd.concat([pd.read_csv(f) for f in filenames])

In [14]:
type(globadf)

pandas.core.frame.DataFrame

## Sorting DataFrame with the Index & columns

It is often useful to rearrange the sequence of the rows of a DataFrame by sorting. You don't have to implement these yourself; the principal methods for doing this are .sort_index() and .sort_values().

In this exercise, you'll use these methods with a DataFrame of temperature values indexed by month names. You'll sort the rows alphabetically using the Index and numerically using a column. Notice, for this data, the original ordering is probably most useful and intuitive: the purpose here is for you to understand what the sorting methods do.

In [16]:
# Import pandas
import pandas as pd

# Read 'monthly_max_temp.csv' into a DataFrame: weather1
weather1 = pd.read_csv('K:\\TensorflowPY36CPU\\TensorflowPY36CPU\\_1_PythonBasic\\Pandas\\maxtemperture.csv',index_col='Month')

# Print the head of weather1
print(weather1.head())

# Sort the index of weather1 in alphabetical order: weather2
weather2 = weather1.sort_index()

# Print the head of weather2
print(weather2.head())

# Sort the index of weather1 in reverse alphabetical order: weather3
weather3 = weather1.sort_index(ascending=False)

# Print the head of weather3
print(weather3.head())

# Sort weather1 numerically using the values of 'Max TemperatureF': weather4
weather4 =weather1.sort_values('Max TemperatureF')

# Print the head of weather4
print(weather4.head())

        Max TemperatureF
Month
Jan                   68
Feb                   60
Mar                   68
Apr                   84
May                   88
           Max TemperatureF
Month
Apr                      84
Aug                      86
Dec                      68
Feb                      60
Jan                      68
             Max TemperatureF
Month
Sep                        90
Oct                        84
Nov                        72
May                        88
Mar                        68
       Max TemperatureF
Month
Feb                  60
Jan                  68
Mar                  68
Dec                  68
Nov                  72

## rindexing DataFrame from a list
Sorting methods are not the only way to change DataFrame Indexes. There is also the .reindex() method.

In this exercise, you'll reindex a DataFrame of quarterly-sampled mean temperature values to contain monthly samples (this is an example of upsampling or increasing the rate of samples, which you may recall from the pandas Foundations course).

The original data has the first month's abbreviation of the quarter (three-month interval) on the Index, namely Apr, Jan, Jul, and Sep. This data has been loaded into a DataFrame called weather1 and has been printed in its entirety in the IPython Shell. Notice it has only four rows (corresponding to the first month of each quarter) and that the rows are not sorted chronologically.

You'll initially use a list of all twelve month abbreviations and subsequently apply the .ffill() method to forward-fill the null entries when upsampling. This list of month abbreviations has been pre-loaded as year.

In [18]:
# Import pandas
import pandas as pd
import numpy as np
weather1  = pd.read_csv('K:\\TensorflowPY36CPU\\TensorflowPY36CPU\\_1_PythonBasic\\Pandas\\temperture.csv',index_col='Month')



year = ['Jan',
        'Feb',
        'Mar',
        'Apr',
        'May',
        'Jun',
        'Jul',
        'Aug',
        'Sep',
        'Oct',
        'Nov',
        'Dec']



# Reindex weather1 using the list year: weather2
weather2 = weather1.reindex(year)

# Print weather2
print(weather2)

# Reindex weather1 using the list year with forward-fill: weather3
weather3 = weather1.reindex(year).ffill()

# Print weather3
print(weather3)

       Mean TemperatureF
Month
Jan            32.133333
Feb                  NaN
Mar                  NaN
Apr            61.956044
May                  NaN
Jun                  NaN
Jul            68.934783
Aug                  NaN
Sep                  NaN
Oct            43.434783
Nov                  NaN
Dec                  NaN
       Mean TemperatureF
Month
Jan            32.133333
Feb            32.133333
Mar            32.133333
Apr            61.956044
May            61.956044
Jun            61.956044
Jul            68.934783
Aug            68.934783
Sep            68.934783
Oct            43.434783
Nov            43.434783
Dec            43.434783

In [19]:
weather1.head()

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>Mean TemperatureF</th>
    </tr>
    <tr>
      <th>Month</th>
      <th></th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>Apr</th>
      <td>61.956044</td>
    </tr>
    <tr>
      <th>Jan</th>
      <td>32.133333</td>
    </tr>
    <tr>
      <th>Jul</th>
      <td>68.934783</td>
    </tr>
    <tr>
      <th>Oct</th>
      <td>43.434783</td>
    </tr>
  </tbody>
</table>
</div>

## Reindexing using another DataFrame Index

nother common technique is to reindex a DataFrame using the Index of another DataFrame. The DataFrame .reindex() method can accept the Index of a DataFrame or Series as input. You can access the Index of a DataFrame with its .index attribute.

The Baby Names Dataset from data.gov summarizes counts of names (with genders) from births registered in the US since 1881. In this exercise, you will start with two baby-names DataFrames names_1981 and names_1881 loaded for you.

The DataFrames names_1981 and names_1881 both have a MultiIndex with levels name and gender giving unique labels to counts in each row. If you're interested in seeing how the MultiIndexes were set up, names_1981 and names_1881 were read in using the following commands:

names_1981 = pd.read_csv('names1981.csv', header=None, names=['name','gender','count'], index_col=(0,1))
names_1881 = pd.read_csv('names1881.csv', header=None, names=['name','gender','count'], index_col=(0,1))
As you can see by looking at their shapes, which have been printed in the IPython Shell, the DataFrame corresponding to 1981 births is much larger, reflecting the greater diversity of names in 1981 as compared to 1881.

Your job here is to use the DataFrame .reindex() and .dropna() methods to make a DataFrame common_names counting names from 1881 that were still popular in 1981.

In [21]:
#Init

names_1981 = pd.read_csv('K:\\TensorflowPY36CPU\\TensorflowPY36CPU\\_1_PythonBasic\\Pandas\\names1981.csv', header=None, names=['name','gender','count'], index_col=(0,1))

names_1881 = pd.read_csv('K:\\TensorflowPY36CPU\\TensorflowPY36CPU\\_1_PythonBasic\\Pandas\\names1881.csv', header=None, names=['name','gender','count'], index_col=(0,1))

In [22]:
# Import pandas
import pandas as pd

# Reindex names_1981 with index of names_1881: common_names
#Create a new DataFrame common_names by reindexing names_1981 using the Index of the DataFrame names_1881 of older names.
common_names = names_1981.reindex(names_1881.index)

# Print shape of common_names
print(common_names.shape)

# Drop rows with null counts: common_names
common_names = common_names.dropna()

# Print shape of new common_names
print(common_names.shape)

(1935, 1)
(1587, 1)

##

##

## Broadcasting in arithmetic formulas
In this exercise, you'll work with weather data pulled from wunderground.com. The DataFrame weather has been pre-loaded along with pandas as pd. It has 365 rows (observed each day of the year 2013 in Pittsburgh, PA) and 22 columns reflecting different weather measurements each day.

You'll subset a collection of columns related to temperature measurements in degrees Fahrenheit, convert them to degrees Celsius, and relabel the columns of the new DataFrame to reflect the change of units.

Remember, ordinary arithmetic operators (like +, -, *, and /) broadcast scalar values to conforming DataFrames when combining scalars & DataFrames in arithmetic expressions. Broadcasting also works with pandas Series and NumPy arrays.

In [24]:
## init
import pandas as pd

weather = pd.read_csv('K:\\TensorflowPY36CPU\\TensorflowPY36CPU\\_1_PythonBasic\\Pandas\\/pittsburgh2013.csv',index_col='Date')

In [25]:
print(weather.head())

          Max TemperatureF  Mean TemperatureF  Min TemperatureF  \
Date
2013-1-1                32                 28                21
2013-1-2                25                 21                17
2013-1-3                32                 24                16
2013-1-4                30                 28                27
2013-1-5                34                 30                25

          Max Dew PointF  MeanDew PointF  Min DewpointF  Max Humidity  \
Date
2013-1-1              30              27             16           100
2013-1-2              14              12             10            77
2013-1-3              19              15              9            77
2013-1-4              21              19             17            75
2013-1-5              23              20             16            75

          Mean Humidity  Min Humidity  Max Sea Level PressureIn  \
Date
2013-1-1             89            77                     30.10
2013-1-2             67            55                     30.27
2013-1-3             67            56                     30.25
2013-1-4             68            59                     30.28
2013-1-5             68            61                     30.42

               ...        Max VisibilityMiles  Mean VisibilityMiles  \
Date           ...
2013-1-1       ...                         10                     6
2013-1-2       ...                         10                    10
2013-1-3       ...                         10                    10
2013-1-4       ...                         10                    10
2013-1-5       ...                         10                    10

          Min VisibilityMiles  Max Wind SpeedMPH  Mean Wind SpeedMPH  \
Date
2013-1-1                    2                 10                   8
2013-1-2                   10                 14                   5
2013-1-3                   10                 17                   8
2013-1-4                    6                 23                  16
2013-1-5                   10                 16                  10

          Max Gust SpeedMPH  PrecipitationIn   CloudCover  Events  \
Date
2013-1-1                NaN             0.00            8    Snow
2013-1-2                NaN             0.00            4     NaN
2013-1-3               26.0             0.00            3     NaN
2013-1-4               32.0             0.00            4     NaN
2013-1-5               23.0             0.21            5     NaN

          WindDirDegrees
Date
2013-1-1             277
2013-1-2             272
2013-1-3             229
2013-1-4             250
2013-1-5             221

[5 rows x 22 columns]

In [26]:
# Excerise

# Extract selected columns from weather as new DataFrame: temps_f
temps_f = weather[['Min TemperatureF','Mean TemperatureF','Max TemperatureF']]

# Convert temps_f to celsius: temps_c
temps_c = (temps_f - 32) * 5/9

# Rename 'F' in column names with 'C': temps_c.columns
temps_c.columns =temps_c.columns.str.replace('F','C')

# Print first 5 rows of temps_c
print(temps_c.head())

          Min TemperatureC  Mean TemperatureC  Max TemperatureC
Date
2013-1-1         -6.111111          -2.222222          0.000000
2013-1-2         -8.333333          -6.111111         -3.888889
2013-1-3         -8.888889          -4.444444          0.000000
2013-1-4         -2.777778          -2.222222         -1.111111
2013-1-5         -3.888889          -1.111111          1.111111

# Computing percentage growth of GDP
Your job in this exercise is to compute the yearly percent-change of US GDP (Gross Domestic Product) since 2008.

The data has been obtained from the Federal Reserve Bank of St. Louis and is available in the file GDP.csv, which contains quarterly data; you will resample it to annual sampling and then compute the annual growth of GDP. For a refresher on resampling, check out the relevant material from pandas Foundations.

In [27]:
import pandas as pd

# Read 'GDP.csv' into a DataFrame: gdp
gdp = pd.read_csv('K:\\TensorflowPY36CPU\\TensorflowPY36CPU\\_1_PythonBasic\\Pandas\\/gdp_usa.csv',parse_dates=True, index_col='DATE')

In [28]:
gdp.head()

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>VALUE</th>
    </tr>
    <tr>
      <th>DATE</th>
      <th></th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>1947-01-01</th>
      <td>243.1</td>
    </tr>
    <tr>
      <th>1947-04-01</th>
      <td>246.3</td>
    </tr>
    <tr>
      <th>1947-07-01</th>
      <td>250.1</td>
    </tr>
    <tr>
      <th>1947-10-01</th>
      <td>260.3</td>
    </tr>
    <tr>
      <th>1948-01-01</th>
      <td>266.2</td>
    </tr>
  </tbody>
</table>
</div>

In [29]:

# Slice all the gdp data from 2008 onward: post2008
post2008 = gdp.loc['2008':]

# Print the last 8 rows of post2008
print(post2008.tail(8))

# Resample post2008 by year, keeping last(): yearly
yearly = post2008.resample('A').last()

# Print yearly
print(yearly)

# Compute percentage growth of yearly: yearly['growth']
yearly['growth'] = yearly.pct_change()*100

# Print yearly again
print(yearly)

              VALUE
DATE
2014-07-01  17569.4
2014-10-01  17692.2
2015-01-01  17783.6
2015-04-01  17998.3
2015-07-01  18141.9
2015-10-01  18222.8
2016-01-01  18281.6
2016-04-01  18436.5
              VALUE
DATE
2008-12-31  14549.9
2009-12-31  14566.5
2010-12-31  15230.2
2011-12-31  15785.3
2012-12-31  16297.3
2013-12-31  16999.9
2014-12-31  17692.2
2015-12-31  18222.8
2016-12-31  18436.5
              VALUE    growth
DATE
2008-12-31  14549.9       NaN
2009-12-31  14566.5  0.114090
2010-12-31  15230.2  4.556345
2011-12-31  15785.3  3.644732
2012-12-31  16297.3  3.243524
2013-12-31  16999.9  4.311144
2014-12-31  17692.2  4.072377
2015-12-31  18222.8  2.999062
2016-12-31  18436.5  1.172707

## Converting currency of stocks

n this exercise, stock prices in US Dollars for the S&P 500 in 2015 have been obtained from Yahoo Finance. The files sp500.csv for sp500 and exchange.csv for the exchange rates are both provided to you.

Using the daily exchange rate to Pounds Sterling, your task is to convert both the Open and Close column prices.

In [31]:
# Import pandas
import pandas as pd

# Read 'sp500.csv' into a DataFrame: sp500
sp500 = pd.read_csv('K:\\TensorflowPY36CPU\\TensorflowPY36CPU\\_1_PythonBasic\\Pandas\\sp500.csv',parse_dates=True,index_col='Date')

# Read 'exchange.csv' into a DataFrame: exchange
exchange = pd.read_csv('K:\\TensorflowPY36CPU\\TensorflowPY36CPU\\_1_PythonBasic\\Pandas\\exchange.csv',parse_dates=True,index_col='Date')

# Subset 'Open' & 'Close' columns from sp500: dollars
dollars = sp500[['Open','Close']]

# Print the head of dollars
print(dollars.head())

# Convert dollars to pounds: pounds
pounds = dollars.multiply(exchange['GBP/USD'],axis='rows')

# Print the head of pounds
print(pounds.head())

                   Open        Close
Date
2015-01-02  2058.899902  2058.199951
2015-01-05  2054.439941  2020.579956
2015-01-06  2022.150024  2002.609985
2015-01-07  2005.550049  2025.900024
2015-01-08  2030.609985  2062.139893
                   Open        Close
Date
2015-01-02  1340.364425  1339.908750
2015-01-05  1348.616555  1326.389506
2015-01-06  1332.515980  1319.639876
2015-01-07  1330.562125  1344.063112
2015-01-08  1343.268811  1364.126161

##

                   Open        Close
Date
2015-01-02  2058.899902  2058.199951
2015-01-05  2054.439941  2020.579956
2015-01-06  2022.150024  2002.609985
2015-01-07  2005.550049  2025.900024
2015-01-08  2030.609985  2062.139893
                   Open        Close
Date
2015-01-02  1340.364425  1339.908750
2015-01-05  1348.616555  1326.389506
2015-01-06  1332.515980  1319.639876
2015-01-07  1330.562125  1344.063112
2015-01-08  1343.268811  1364.126161

In [11]:
# Import pandas
import pandas as pd

# Read 'sp500.csv' into a DataFrame: sp500
sp500 = pd.read_csv('K:\\TensorflowPY36CPU\\TensorflowPY36CPU\\_1_PythonBasic\\Pandas\\sp500.csv',parse_dates=True,index_col='Date')

# Read 'exchange.csv' into a DataFrame: exchange
exchange = pd.read_csv('K:\\TensorflowPY36CPU\\TensorflowPY36CPU\\_1_PythonBasic\\Pandas\\exchange.csv',parse_dates=True,index_col='Date')

# Subset 'Open' & 'Close' columns from sp500: dollars
dollars = sp500[['Open','Close']]

# Print the head of dollars
print(dollars.head())

# Convert dollars to pounds: pounds
pounds = dollars.multiply(exchange['GBP/USD'],axis='rows')

# Print the head of pounds
print(pounds.head())

                   Open        Close
Date
2015-01-02  2058.899902  2058.199951
2015-01-05  2054.439941  2020.579956
2015-01-06  2022.150024  2002.609985
2015-01-07  2005.550049  2025.900024
2015-01-08  2030.609985  2062.139893
                   Open        Close
Date
2015-01-02  1340.364425  1339.908750
2015-01-05  1348.616555  1326.389506
2015-01-06  1332.515980  1319.639876
2015-01-07  1330.562125  1344.063112
2015-01-08  1343.268811  1364.126161

## Appending pandas Series

In this exercise, you'll load sales data from the months January, February, and March into DataFrames. Then, you'll extract Series with the 'Units' column from each and append them together with method chaining using .append().

To check that the stacking worked, you'll print slices from these Series, and finally, you'll add the result to figure out the total units sold in the first quarter.

In [32]:
# Import pandas
import pandas as pd

# Load 'sales-jan-2015.csv' into a DataFrame: jan
jan = pd.read_csv('K:\\TensorflowPY36CPU\\TensorflowPY36CPU\\_1_PythonBasic\\Pandas\\sales-jan-2015.csv',parse_dates=True,index_col='Date')

# Load 'sales-feb-2015.csv' into a DataFrame: feb
feb = pd.read_csv('K:\\TensorflowPY36CPU\\TensorflowPY36CPU\\_1_PythonBasic\\Pandas\\sales-feb-2015.csv',parse_dates=True,index_col='Date')

# Load 'sales-mar-2015.csv' into a DataFrame: mar
mar = pd.read_csv('K:\\TensorflowPY36CPU\\TensorflowPY36CPU\\_1_PythonBasic\\Pandas\\sales-mar-2015.csv',parse_dates=True,index_col='Date')

# Extract the 'Units' column from jan: jan_units
jan_units = jan['Units']

# Extract the 'Units' column from feb: feb_units
feb_units = feb['Units']

# Extract the 'Units' column from mar: mar_units
mar_units = mar['Units']

# Append feb_units and then mar_units to jan_units: quarter1
quarter1 = jan_units.append(feb_units).append(mar_units)

# Print the first slice from quarter1
print(quarter1.loc['jan 27, 2015':'feb 2, 2015'])

# Print the second slice from quarter1
print(quarter1.loc['feb 26, 2015':'mar 7, 2015' ])

# Compute & print total sales in quarter1
print(quarter1.sum())

Date
2015-01-27 07:11:55    18
2015-02-02 08:33:01     3
2015-02-02 20:54:49     9
Name: Units, dtype: int64
Date
2015-02-26 08:57:45     4
2015-02-26 08:58:51     1
2015-03-06 10:11:45    17
2015-03-06 02:03:56    17
Name: Units, dtype: int64
642

# Concatenating pandas Series along row axis

Having learned how to append Series, you'll now learn how to achieve the same result by concatenating Series instead. You'll continue to work with the sales data you've seen previously. This time, the DataFrames jan, feb, and mar have been pre-loaded.

Your job is to use pd.concat() with a list of Series to achieve the same result that you would get by chaining calls to .append().

You may be wondering about the difference between pd.concat() and pandas' .append() method. One way to think of the difference is that .append() is a specific case of a concatenation, while pd.concat() gives you more flexibility, as you'll see in later exercises.

In [33]:
# Initialize empty list: units
units = []

# Build the list of Series
for month in [jan, feb, mar]:
    units.append(month['Units'])

# Concatenate the list: quarter1
quarter1 = pd.concat(units,axis='rows')

# Print slices from quarter1
print(quarter1.loc['jan 27, 2015':'feb 2, 2015'])
print(quarter1.loc['feb 26, 2015':'mar 7, 2015'])

Date
2015-01-27 07:11:55    18
2015-02-02 08:33:01     3
2015-02-02 20:54:49     9
Name: Units, dtype: int64
Date
2015-02-26 08:57:45     4
2015-02-26 08:58:51     1
2015-03-06 10:11:45    17
2015-03-06 02:03:56    17
Name: Units, dtype: int64

## Appending DataFrames with ignore_index
In this exercise, you'll use the Baby Names Dataset (from data.gov) again. This time, both DataFrames names_1981 and names_1881 are loaded without specifying an Index column (so the default Indexes for both are RangeIndexes).

You'll use the DataFrame .append() method to make a DataFrame combined_names. To distinguish rows from the original two DataFrames, you'll add a 'year' column to each with the year (1881 or 1981 in this case). In addition, you'll specify ignore_index=True so that the index values are not used along the concatenation axis. The resulting axis will instead be labeled 0, 1, ..., n-1, which is useful if you are concatenating objects where the concatenation axis does not have meaningful indexing information.

In [44]:
## init
names_1881 = pd.read_csv(path+'names1881.csv',header=None,names=['name','gender','count'])
names_1981 = pd.read_csv(path+'names1981.csv',header=None,names=['name','gender','count'])

In [45]:
names_1881.head()
names_1981.head()

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>name</th>
      <th>gender</th>
      <th>count</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>Jennifer</td>
      <td>F</td>
      <td>57032</td>
    </tr>
    <tr>
      <th>1</th>
      <td>Jessica</td>
      <td>F</td>
      <td>42519</td>
    </tr>
    <tr>
      <th>2</th>
      <td>Amanda</td>
      <td>F</td>
      <td>34370</td>
    </tr>
    <tr>
      <th>3</th>
      <td>Sarah</td>
      <td>F</td>
      <td>28162</td>
    </tr>
    <tr>
      <th>4</th>
      <td>Melissa</td>
      <td>F</td>
      <td>28003</td>
    </tr>
  </tbody>
</table>
</div>

In [46]:
# Add 'year' column to names_1881 and names_1981
names_1881['year'] = 1881
names_1981['year'] = 1981

# Append names_1981 after names_1881 with ignore_index=True: combined_names
combined_names = names_1881.append(names_1981,ignore_index=True)

# Print shapes of names_1981, names_1881, and combined_names
print(names_1981.shape)
print(names_1881.shape)
print(combined_names.shape)

# Print all rows that contain the name 'Morgan'
print(combined_names.loc[combined_names['name']=='Morgan'])

(19455, 4)
(1935, 4)
(21390, 4)
         name gender  count  year
1283   Morgan      M     23  1881
2096   Morgan      F   1769  1981
14390  Morgan      M    766  1981

## Concatenating pandas DataFrames along column axis
The function pd.concat() can concatenate DataFrames horizontally as well as vertically (vertical is the default). To make the DataFrames stack horizontally, you have to specify the keyword argument axis=1 or axis='columns'.

In this exercise, you'll use weather data with maximum and mean daily temperatures sampled at different rates (quarterly versus monthly). You'll concatenate the rows of both and see that, where rows are missing in the coarser DataFrame, null values are inserted in the concatenated DataFrame. This corresponds to an outer join (which you will explore in more detail in later exercises).

The files 'quarterly_max_temp.csv' and 'monthly_mean_temp.csv' have been pre-loaded into the DataFrames weather_max and weather_mean respectively, and pandas has been imported as pd.

In [49]:
#init
weather_max = pd.read_csv(path+'quarterly_max_temp.csv')
weather_mean = pd.read_csv(path+'monthly_mean_temp.csv')
weather_max.head()
weather_mean.head()

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>Month</th>
      <th>Max TemperatureF</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>Jan</td>
      <td>68</td>
    </tr>
    <tr>
      <th>1</th>
      <td>Apr</td>
      <td>89</td>
    </tr>
    <tr>
      <th>2</th>
      <td>Jul</td>
      <td>91</td>
    </tr>
    <tr>
      <th>3</th>
      <td>Oct</td>
      <td>84</td>
    </tr>
  </tbody>
</table>
</div>

In [51]:
# Concatenate weather_max and weather_mean horizontally: weather
weather = pd.concat([weather_max, weather_mean] ,axis=1)

# Print weather
print(weather)

    Month  Mean TemperatureF  Month  Max TemperatureF
0   Apr            53.100000  Jan                68.0
1   Aug            70.000000  Apr                89.0
2   Dec            34.935484  Jul                91.0
3   Feb            28.714286  Oct                84.0
4   Jan            32.354839    NaN               NaN
5   Jul            72.870968    NaN               NaN
6   Jun            70.133333    NaN               NaN
7   Mar            35.000000    NaN               NaN
8   May            62.612903    NaN               NaN
9   Nov            39.800000    NaN               NaN
10  Oct            55.451613    NaN               NaN
11  Sep            63.766667    NaN               NaN

## Reading multiple files to build a DataFrame

Reading multiple files to build a DataFrame
It is often convenient to build a large DataFrame by parsing many files as DataFrames and concatenating them all at once. You'll do this here with three files, but, in principle, this approach can be used to combine data from dozens or hundreds of files.

Here, you'll work with DataFrames compiled from The Guardian's Olympic medal dataset.

pandas has been imported as pd and two lists have been pre-loaded: An empty list called medals, and medal_types, which contains the strings 'bronze', 'silver', and 'gold'.

In [56]:
# init

medals = []
medal_types = ['bronze', 'silver', 'gold']

In [58]:
for medal in medal_types:

    # Create the file name: file_name
    file_name = path+"%s_top5.csv" % medal
    
    # Create list of column names: columns
    columns = ['Country', medal]
    
    # Read file_name into a DataFrame: df
    medal_df = pd.read_csv(file_name,header=0,index_col='Country',names=columns)

    # Append medal_df to medals
    medals.append(medal_df)

# Concatenate medals horizontally: medals
medals = pd.concat(medals,axis='columns')

# Print medals
print(medals)

                bronze  silver    gold
France           475.0   461.0     NaN
Germany          454.0     NaN   407.0
Italy              NaN   394.0   460.0
Soviet Union     584.0   627.0   838.0
United Kingdom   505.0   591.0   498.0
United States   1052.0  1195.0  2088.0

## Concatenating vertically to get MultiIndexed rows
When stacking a sequence of DataFrames vertically, it is sometimes desirable to construct a MultiIndex to indicate the DataFrame from which each row originated. This can be done by specifying the keys parameter in the call to pd.concat(), which generates a hierarchical index with the labels from keys as the outermost index label. So you don't have to rename the columns of each DataFrame as you load it. Instead, only the Index column needs to be specified.

Here, you'll continue working with DataFrames compiled from The Guardian's Olympic medal dataset. Once again, pandas has been imported as pd and two lists have been pre-loaded: An empty list called medals, and medal_types, which contains the strings 'bronze', 'silver', and 'gold'.

In [67]:
# init

medals = []
medal_types = ['bronze', 'silver', 'gold']

In [68]:
for medal in medal_types:

    file_name = path+"%s_top5.csv" % medal
    
    # Read file_name into a DataFrame: medal_df
    medal_df = pd.read_csv(file_name,index_col='Country')
    
    # Append medal_df to medals
    medals.append(medal_df)
    
    
# Concatenate medals: medals
medals = pd.concat(medals,keys=['bronze', 'silver', 'gold'] )

# Print medals in entirety
print(medals)

                        Total
       Country
bronze United States   1052.0
       Soviet Union     584.0
       United Kingdom   505.0
       France           475.0
       Germany          454.0
silver United States   1195.0
       Soviet Union     627.0
       United Kingdom   591.0
       France           461.0
       Italy            394.0
gold   United States   2088.0
       Soviet Union     838.0
       United Kingdom   498.0
       Italy            460.0
       Germany          407.0

## This exercise picks up where the last ended (again using The Guardian's Olympic medal dataset).

You are provided with the MultiIndexed DataFrame as produced at the end of the preceding exercise. Your task is to sort the DataFrame and to use the pd.IndexSlice to extract specific slices. Check out this exercise from Manipulating DataFrames with pandas to refresh your memory on how to deal with MultiIndexed DataFrames.

pandas has been imported for you as pd and the DataFrame medals is already in your namespace.

In [70]:
# Sort the entries of medals: medals_sorted
medals_sorted = medals.sort_index(level=0)

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th></th>
      <th>Total</th>
    </tr>
    <tr>
      <th></th>
      <th>Country</th>
      <th></th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th rowspan="5" valign="top">bronze</th>
      <th>France</th>
      <td>475.0</td>
    </tr>
    <tr>
      <th>Germany</th>
      <td>454.0</td>
    </tr>
    <tr>
      <th>Soviet Union</th>
      <td>584.0</td>
    </tr>
    <tr>
      <th>United Kingdom</th>
      <td>505.0</td>
    </tr>
    <tr>
      <th>United States</th>
      <td>1052.0</td>
    </tr>
    <tr>
      <th rowspan="5" valign="top">gold</th>
      <th>Germany</th>
      <td>407.0</td>
    </tr>
    <tr>
      <th>Italy</th>
      <td>460.0</td>
    </tr>
    <tr>
      <th>Soviet Union</th>
      <td>838.0</td>
    </tr>
    <tr>
      <th>United Kingdom</th>
      <td>498.0</td>
    </tr>
    <tr>
      <th>United States</th>
      <td>2088.0</td>
    </tr>
    <tr>
      <th rowspan="5" valign="top">silver</th>
      <th>France</th>
      <td>461.0</td>
    </tr>
    <tr>
      <th>Italy</th>
      <td>394.0</td>
    </tr>
    <tr>
      <th>Soviet Union</th>
      <td>627.0</td>
    </tr>
    <tr>
      <th>United Kingdom</th>
      <td>591.0</td>
    </tr>
    <tr>
      <th>United States</th>
      <td>1195.0</td>
    </tr>
  </tbody>
</table>
</div>

In [72]:
medals_sorted

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th></th>
      <th>Total</th>
    </tr>
    <tr>
      <th></th>
      <th>Country</th>
      <th></th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th rowspan="5" valign="top">bronze</th>
      <th>France</th>
      <td>475.0</td>
    </tr>
    <tr>
      <th>Germany</th>
      <td>454.0</td>
    </tr>
    <tr>
      <th>Soviet Union</th>
      <td>584.0</td>
    </tr>
    <tr>
      <th>United Kingdom</th>
      <td>505.0</td>
    </tr>
    <tr>
      <th>United States</th>
      <td>1052.0</td>
    </tr>
    <tr>
      <th rowspan="5" valign="top">gold</th>
      <th>Germany</th>
      <td>407.0</td>
    </tr>
    <tr>
      <th>Italy</th>
      <td>460.0</td>
    </tr>
    <tr>
      <th>Soviet Union</th>
      <td>838.0</td>
    </tr>
    <tr>
      <th>United Kingdom</th>
      <td>498.0</td>
    </tr>
    <tr>
      <th>United States</th>
      <td>2088.0</td>
    </tr>
    <tr>
      <th rowspan="5" valign="top">silver</th>
      <th>France</th>
      <td>461.0</td>
    </tr>
    <tr>
      <th>Italy</th>
      <td>394.0</td>
    </tr>
    <tr>
      <th>Soviet Union</th>
      <td>627.0</td>
    </tr>
    <tr>
      <th>United Kingdom</th>
      <td>591.0</td>
    </tr>
    <tr>
      <th>United States</th>
      <td>1195.0</td>
    </tr>
  </tbody>
</table>
</div>

In [ ]:


# Print the number of Bronze medals won by Germany
print(medals_sorted.loc[('bronze','Germany')])

# Print data about silver medals
print(medals_sorted.loc['silver'])

# Create alias for pd.IndexSlice: idx
idx = pd.IndexSlice

# Print all the data on medals won by the United Kingdom
print(medals_sorted.loc[idx[:, 'United Kingdom'], :])

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th></th>
      <th>Total</th>
    </tr>
    <tr>
      <th></th>
      <th>Country</th>
      <th></th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th rowspan="5" valign="top">bronze</th>
      <th>France</th>
      <td>475.0</td>
    </tr>
    <tr>
      <th>Germany</th>
      <td>454.0</td>
    </tr>
    <tr>
      <th>Soviet Union</th>
      <td>584.0</td>
    </tr>
    <tr>
      <th>United Kingdom</th>
      <td>505.0</td>
    </tr>
    <tr>
      <th>United States</th>
      <td>1052.0</td>
    </tr>
    <tr>
      <th rowspan="5" valign="top">gold</th>
      <th>Germany</th>
      <td>407.0</td>
    </tr>
    <tr>
      <th>Italy</th>
      <td>460.0</td>
    </tr>
    <tr>
      <th>Soviet Union</th>
      <td>838.0</td>
    </tr>
    <tr>
      <th>United Kingdom</th>
      <td>498.0</td>
    </tr>
    <tr>
      <th>United States</th>
      <td>2088.0</td>
    </tr>
    <tr>
      <th rowspan="5" valign="top">silver</th>
      <th>France</th>
      <td>461.0</td>
    </tr>
    <tr>
      <th>Italy</th>
      <td>394.0</td>
    </tr>
    <tr>
      <th>Soviet Union</th>
      <td>627.0</td>
    </tr>
    <tr>
      <th>United Kingdom</th>
      <td>591.0</td>
    </tr>
    <tr>
      <th>United States</th>
      <td>1195.0</td>
    </tr>
  </tbody>
</table>
</div>

# Concatenating horizontally to get MultiIndexed columns
It is also possible to construct a DataFrame with hierarchically indexed columns. For this exercise, you'll start with pandas imported and a list of three DataFrames called dataframes. All three DataFrames contain 'Company', 'Product', and 'Units' columns with a 'Date' column as the index pertaining to sales transactions during the month of February, 2015. The first DataFrame describes Hardware transactions, the second describes Software transactions, and the third, Service transactions.

Your task is to concatenate the DataFrames horizontally and to create a MultiIndex on the columns. From there, you can summarize the resulting DataFrame and slice some information from it.

In [124]:
#init
Hardware = pd.read_csv(path+'feb-sales-Hardware.csv',index_col='Date')
Software = pd.read_csv(path+'feb-sales-Software.csv',index_col='Date')
Service= pd.read_csv(path+'feb-sales-Service.csv',index_col='Date')
dataframes = [Hardware,Software,Service]

dataframes

[                             Company   Product  Units
 Date
 2015-02-04 21:52:45  Acme Coporation  Hardware     14
 2015-02-07 22:58:10  Acme Coporation  Hardware      1
 2015-02-19 10:59:33        Mediacore  Hardware     16
 2015-02-02 20:54:49        Mediacore  Hardware      9
 2015-02-21 20:41:47            Hooli  Hardware      3,
                              Company   Product  Units
 Date
 2015-02-16 12:09:19            Hooli  Software     10
 2015-02-03 14:14:18          Initech  Software     13
 2015-02-02 08:33:01            Hooli  Software      3
 2015-02-05 01:53:06  Acme Coporation  Software     19
 2015-02-11 20:03:08          Initech  Software      7
 2015-02-09 13:09:55        Mediacore  Software      7
 2015-02-11 22:50:44            Hooli  Software      4
 2015-02-04 15:36:29        Streeplex  Software     13
 2015-02-21 05:01:26        Mediacore  Software      3,
                        Company  Product  Units
 Date
 2015-02-26 08:57:45  Streeplex  Service      4
 2015-02-25 00:29:00    Initech  Service     10
 2015-02-09 08:57:30  Streeplex  Service     19
 2015-02-26 08:58:51  Streeplex  Service      1
 2015-02-05 22:05:03      Hooli  Service     10
 2015-02-19 16:02:58  Mediacore  Service     10]

In [125]:
# Concatenate dataframes: february
february = pd.concat(dataframes, axis=1, keys=['Hardware', 'Software', 'Service'])

In [126]:
february.info()
print(february.head())

<class 'pandas.core.frame.DataFrame'>
Index: 20 entries, 2015-02-02 08:33:01 to 2015-02-26 08:58:51
Data columns (total 9 columns):
(Hardware, Company)    5 non-null object
(Hardware, Product)    5 non-null object
(Hardware, Units)      5 non-null float64
(Software, Company)    9 non-null object
(Software, Product)    9 non-null object
(Software, Units)      9 non-null float64
(Service, Company)     6 non-null object
(Service, Product)     6 non-null object
(Service, Units)       6 non-null float64
dtypes: float64(3), object(6)
memory usage: 1.6+ KB
                            Hardware                   Software            \
                             Company   Product Units    Company   Product
2015-02-02 08:33:01              NaN       NaN   NaN      Hooli  Software
2015-02-02 20:54:49        Mediacore  Hardware   9.0        NaN       NaN
2015-02-03 14:14:18              NaN       NaN   NaN    Initech  Software
2015-02-04 15:36:29              NaN       NaN   NaN  Streeplex  Software
2015-02-04 21:52:45  Acme Coporation  Hardware  14.0        NaN       NaN

                          Service
                    Units Company Product Units
2015-02-02 08:33:01   3.0     NaN     NaN   NaN
2015-02-02 20:54:49   NaN     NaN     NaN   NaN
2015-02-03 14:14:18  13.0     NaN     NaN   NaN
2015-02-04 15:36:29  13.0     NaN     NaN   NaN
2015-02-04 21:52:45   NaN     NaN     NaN   NaN

In [ ]:

# Print february.info()
print(february.info())

# Assign pd.IndexSlice: idx
idx = pd.IndexSlice

# Create the slice: slice_2_8
#Extract a slice called slice_2_8 from february (using .loc[] & idx) that comprises rows between Feb. 2, 2015 to Feb. 8, 2015 from columns under 'Company'.
slice_2_8 = february.loc['Feb 2,2015':'Feb 8,2015', idx[:, 'Company']]

# Print slice_2_8
print(slice_2_8)

In [128]:
# Print slice_2_8
print(slice_2_8)

Empty DataFrame
Columns: [(Hardware, Company), (Software, Company), (Service, Company)]
Index: []

## Concatenating DataFrames from a dict

You're now going to revisit the sales data you worked with earlier in the chapter. Three DataFrames jan, feb, and mar have been pre-loaded for you. Your task is to aggregate the sum of all sales over the 'Company' column into a single DataFrame. You'll do this by constructing a dictionary of these DataFrames and then concatenating them.

## Concatenating DataFrames with inner join
Concatenating DataFrames with inner join
Here, you'll continue working with DataFrames compiled from The Guardian's Olympic medal dataset.

The DataFrames bronze, silver, and gold have been pre-loaded for you.

Your task is to compute an inner join.

In [132]:
# Make the list of tuples: month_list
#Create a list called month_list consisting of the tuples ('january', jan), ('february', feb), and ('march', mar).
month_list = [('january', jan),('february', feb),('march', mar)]

# Create an empty dictionary: month_dict
month_dict = dict()

for month_name, month_data in month_list:

    # Group month_data: month_dict[month_name]
    month_dict[month_name] = month_data.groupby('Company').sum()

# Concatenate data in month_dict: sales
sales = pd.concat(month_dict)

# Print sales
print(sales)

# Print all sales by Mediacore
idx = pd.IndexSlice
print(sales.loc[idx[:, 'Mediacore'], :])

                          Units
         Company
february Acme Coporation     34
         Hooli               30
         Initech             30
         Mediacore           45
         Streeplex           37
january  Acme Coporation     76
         Hooli               70
         Initech             37
         Mediacore           15
         Streeplex           50
march    Acme Coporation      5
         Hooli               37
         Initech             68
         Mediacore           68
         Streeplex           40
                    Units
         Company
february Mediacore     45
january  Mediacore     15
march    Mediacore     68

## Concatenating DataFrames with inner join
Concatenating DataFrames with inner join
Here, you'll continue working with DataFrames compiled from The Guardian's Olympic medal dataset.

The DataFrames bronze, silver, and gold have been pre-loaded for you.

Your task is to compute an inner join.

    bronze                                silver                         \
       NOC                Country   Total    NOC                Country
0      USA          United States  1052.0    USA          United States
1      URS           Soviet Union   584.0    URS           Soviet Union
2      GBR         United Kingdom   505.0    GBR         United Kingdom
3      FRA                 France   475.0    FRA                 France
4      GER                Germany   454.0    GER                Germany
5      AUS              Australia   413.0    AUS              Australia
6      ITA                  Italy   374.0    ITA                  Italy
7      HUN                Hungary   345.0    HUN                Hungary
8      SWE                 Sweden   325.0    SWE                 Sweden
9      NED            Netherlands   320.0    NED            Netherlands
10     ROU                Romania   282.0    ROU                Romania
11     JPN                  Japan   270.0    JPN                  Japan
12     RUS                 Russia   240.0    RUS                 Russia
13     CAN                 Canada   227.0    CAN                 Canada
14     GDR           East Germany   225.0    GDR           East Germany
15     POL                 Poland   223.0    POL                 Poland
16     FIN                Finland   209.0    FIN                Finland
17     CHN                  China   193.0    CHN                  China
18     FRG           West Germany   180.0    FRG           West Germany
19     BRA                 Brazil   174.0    BRA                 Brazil
20     DEN                Denmark   152.0    DEN                Denmark
21     BEL                Belgium   150.0    BEL                Belgium
22     NOR                 Norway   144.0    NOR                 Norway
23     SUI            Switzerland   138.0    SUI            Switzerland
24     BUL               Bulgaria   136.0    BUL               Bulgaria
25     KOR           Korea, South   135.0    KOR           Korea, South
26     YUG             Yugoslavia   118.0    YUG             Yugoslavia
27     CUB                   Cuba   109.0    CUB                   Cuba
28     TCH         Czechoslovakia   105.0    TCH         Czechoslovakia
29     ESP                  Spain    92.0    ESP                  Spain
..     ...                    ...     ...    ...                    ...
108    BAR               Barbados     1.0    BAR               Barbados
109    BER               Bermuda*     1.0    BER               Bermuda*
110    DJI               Djibouti     1.0    DJI               Djibouti
111    ERI                Eritrea     1.0    ERI                Eritrea
112    GUY                 Guyana     1.0    GUY                 Guyana
113    IRQ                   Iraq     1.0    IRQ                   Iraq
114    KUW                 Kuwait     1.0    KUW                 Kuwait
115    MKD              Macedonia     1.0    MKD              Macedonia
116    MRI              Mauritius     1.0    MRI              Mauritius
117    NIG                  Niger     1.0    NIG                  Niger
118    TOG                   Togo     1.0    TOG                   Togo
119    PAR               Paraguay     NaN    PAR               Paraguay
120    PER                   Peru     NaN    PER                   Peru
121    SCG                 Serbia     NaN    SCG                 Serbia
122    NAM                Namibia     NaN    NAM                Namibia
123    SIN              Singapore     NaN    SIN              Singapore
124    HKG             Hong Kong*     NaN    HKG             Hong Kong*
125    SRI              Sri Lanka     NaN    SRI              Sri Lanka
126    TAN               Tanzania     NaN    TAN               Tanzania
127    VIE                Vietnam     NaN    VIE                Vietnam
128    ECU                Ecuador     NaN    ECU                Ecuador
129    LUX             Luxembourg     NaN    LUX             Luxembourg
130    AHO  Netherlands Antilles*     NaN    AHO  Netherlands Antilles*
131    CIV          Cote d'Ivoire     NaN    CIV          Cote d'Ivoire
132    ISV        Virgin Islands*     NaN    ISV        Virgin Islands*
133    SEN                Senegal     NaN    SEN                Senegal
134    SUD                  Sudan     NaN    SUD                  Sudan
135    TGA                  Tonga     NaN    TGA                  Tonga
136    BDI                Burundi     NaN    BDI                Burundi
137    UAE   United Arab Emirates     NaN    UAE   United Arab Emirates

            gold
      Total  NOC                Country   Total
0    1195.0  USA          United States  2088.0
1     627.0  URS           Soviet Union   838.0
2     591.0  GBR         United Kingdom   498.0
3     461.0  FRA                 France   378.0
4     350.0  GER                Germany   407.0
5     369.0  AUS              Australia   293.0
6     394.0  ITA                  Italy   460.0
7     308.0  HUN                Hungary   400.0
8     349.0  SWE                 Sweden   347.0
9     250.0  NED            Netherlands   212.0
10    187.0  ROU                Romania   155.0
11    228.0  JPN                  Japan   206.0
12    206.0  RUS                 Russia   192.0
13    211.0  CAN                 Canada   154.0
14    271.0  GDR           East Germany   329.0
15    173.0  POL                 Poland   103.0
16    118.0  FIN                Finland   124.0
17    252.0  CHN                  China   234.0
18    167.0  FRG           West Germany   143.0
19    139.0  BRA                 Brazil    59.0
20    192.0  DEN                Denmark   147.0
21    167.0  BEL                Belgium    91.0
22    199.0  NOR                 Norway   194.0
23    165.0  SUI            Switzerland    73.0
24    142.0  BUL               Bulgaria    53.0
25    191.0  KOR           Korea, South   140.0
26    174.0  YUG             Yugoslavia   143.0
27    126.0  CUB                   Cuba   160.0
28    144.0  TCH         Czechoslovakia    80.0
29    193.0  ESP                  Spain    92.0
..      ...  ...                    ...     ...
108     NaN  BAR               Barbados     NaN
109     NaN  BER               Bermuda*     NaN
110     NaN  DJI               Djibouti     NaN
111     NaN  ERI                Eritrea     NaN
112     NaN  GUY                 Guyana     NaN
113     NaN  IRQ                   Iraq     NaN
114     NaN  KUW                 Kuwait     NaN
115     NaN  MKD              Macedonia     NaN
116     NaN  MRI              Mauritius     NaN
117     NaN  NIG                  Niger     NaN
118     NaN  TOG                   Togo     NaN
119    17.0  PAR               Paraguay     NaN
120    14.0  PER                   Peru     1.0
121    14.0  SCG                 Serbia     NaN
122     4.0  NAM                Namibia     NaN
123     4.0  SIN              Singapore     NaN
124     2.0  HKG             Hong Kong*     1.0
125     2.0  SRI              Sri Lanka     NaN
126     2.0  TAN               Tanzania     NaN
127     2.0  VIE                Vietnam     NaN
128     1.0  ECU                Ecuador     1.0
129     1.0  LUX             Luxembourg     1.0
130     1.0  AHO  Netherlands Antilles*     NaN
131     1.0  CIV          Cote d'Ivoire     NaN
132     1.0  ISV        Virgin Islands*     NaN
133     1.0  SEN                Senegal     NaN
134     1.0  SUD                  Sudan     NaN
135     1.0  TGA                  Tonga     NaN
136     NaN  BDI                Burundi     1.0
137     NaN  UAE   United Arab Emirates     1.0

[138 rows x 9 columns]

In [133]:
# Create the list of DataFrames: medal_list
#Construct a list of DataFrames called medal_list with entries bronze, silver, and gold.
medal_list = [bronze,silver,gold]

# Concatenate medal_list horizontally using an inner join: medals
medals = pd.concat(medal_list,keys=['bronze', 'silver', 'gold'],axis=1,join='inner')

# Print medals
print(medals)

    bronze                                silver                         \
       NOC                Country   Total    NOC                Country
0      USA          United States  1052.0    USA          United States
1      URS           Soviet Union   584.0    URS           Soviet Union
2      GBR         United Kingdom   505.0    GBR         United Kingdom
3      FRA                 France   475.0    FRA                 France
4      GER                Germany   454.0    GER                Germany
5      AUS              Australia   413.0    AUS              Australia
6      ITA                  Italy   374.0    ITA                  Italy
7      HUN                Hungary   345.0    HUN                Hungary
8      SWE                 Sweden   325.0    SWE                 Sweden
9      NED            Netherlands   320.0    NED            Netherlands
10     ROU                Romania   282.0    ROU                Romania
11     JPN                  Japan   270.0    JPN                  Japan
12     RUS                 Russia   240.0    RUS                 Russia
13     CAN                 Canada   227.0    CAN                 Canada
14     GDR           East Germany   225.0    GDR           East Germany
15     POL                 Poland   223.0    POL                 Poland
16     FIN                Finland   209.0    FIN                Finland
17     CHN                  China   193.0    CHN                  China
18     FRG           West Germany   180.0    FRG           West Germany
19     BRA                 Brazil   174.0    BRA                 Brazil
20     DEN                Denmark   152.0    DEN                Denmark
21     BEL                Belgium   150.0    BEL                Belgium
22     NOR                 Norway   144.0    NOR                 Norway
23     SUI            Switzerland   138.0    SUI            Switzerland
24     BUL               Bulgaria   136.0    BUL               Bulgaria
25     KOR           Korea, South   135.0    KOR           Korea, South
26     YUG             Yugoslavia   118.0    YUG             Yugoslavia
27     CUB                   Cuba   109.0    CUB                   Cuba
28     TCH         Czechoslovakia   105.0    TCH         Czechoslovakia
29     ESP                  Spain    92.0    ESP                  Spain
..     ...                    ...     ...    ...                    ...
108    BAR               Barbados     1.0    BAR               Barbados
109    BER               Bermuda*     1.0    BER               Bermuda*
110    DJI               Djibouti     1.0    DJI               Djibouti
111    ERI                Eritrea     1.0    ERI                Eritrea
112    GUY                 Guyana     1.0    GUY                 Guyana
113    IRQ                   Iraq     1.0    IRQ                   Iraq
114    KUW                 Kuwait     1.0    KUW                 Kuwait
115    MKD              Macedonia     1.0    MKD              Macedonia
116    MRI              Mauritius     1.0    MRI              Mauritius
117    NIG                  Niger     1.0    NIG                  Niger
118    TOG                   Togo     1.0    TOG                   Togo
119    PAR               Paraguay     NaN    PAR               Paraguay
120    PER                   Peru     NaN    PER                   Peru
121    SCG                 Serbia     NaN    SCG                 Serbia
122    NAM                Namibia     NaN    NAM                Namibia
123    SIN              Singapore     NaN    SIN              Singapore
124    HKG             Hong Kong*     NaN    HKG             Hong Kong*
125    SRI              Sri Lanka     NaN    SRI              Sri Lanka
126    TAN               Tanzania     NaN    TAN               Tanzania
127    VIE                Vietnam     NaN    VIE                Vietnam
128    ECU                Ecuador     NaN    ECU                Ecuador
129    LUX             Luxembourg     NaN    LUX             Luxembourg
130    AHO  Netherlands Antilles*     NaN    AHO  Netherlands Antilles*
131    CIV          Cote d'Ivoire     NaN    CIV          Cote d'Ivoire
132    ISV        Virgin Islands*     NaN    ISV        Virgin Islands*
133    SEN                Senegal     NaN    SEN                Senegal
134    SUD                  Sudan     NaN    SUD                  Sudan
135    TGA                  Tonga     NaN    TGA                  Tonga
136    BDI                Burundi     NaN    BDI                Burundi
137    UAE   United Arab Emirates     NaN    UAE   United Arab Emirates

            gold
      Total  NOC                Country   Total
0    1195.0  USA          United States  2088.0
1     627.0  URS           Soviet Union   838.0
2     591.0  GBR         United Kingdom   498.0
3     461.0  FRA                 France   378.0
4     350.0  GER                Germany   407.0
5     369.0  AUS              Australia   293.0
6     394.0  ITA                  Italy   460.0
7     308.0  HUN                Hungary   400.0
8     349.0  SWE                 Sweden   347.0
9     250.0  NED            Netherlands   212.0
10    187.0  ROU                Romania   155.0
11    228.0  JPN                  Japan   206.0
12    206.0  RUS                 Russia   192.0
13    211.0  CAN                 Canada   154.0
14    271.0  GDR           East Germany   329.0
15    173.0  POL                 Poland   103.0
16    118.0  FIN                Finland   124.0
17    252.0  CHN                  China   234.0
18    167.0  FRG           West Germany   143.0
19    139.0  BRA                 Brazil    59.0
20    192.0  DEN                Denmark   147.0
21    167.0  BEL                Belgium    91.0
22    199.0  NOR                 Norway   194.0
23    165.0  SUI            Switzerland    73.0
24    142.0  BUL               Bulgaria    53.0
25    191.0  KOR           Korea, South   140.0
26    174.0  YUG             Yugoslavia   143.0
27    126.0  CUB                   Cuba   160.0
28    144.0  TCH         Czechoslovakia    80.0
29    193.0  ESP                  Spain    92.0
..      ...  ...                    ...     ...
108     NaN  BAR               Barbados     NaN
109     NaN  BER               Bermuda*     NaN
110     NaN  DJI               Djibouti     NaN
111     NaN  ERI                Eritrea     NaN
112     NaN  GUY                 Guyana     NaN
113     NaN  IRQ                   Iraq     NaN
114     NaN  KUW                 Kuwait     NaN
115     NaN  MKD              Macedonia     NaN
116     NaN  MRI              Mauritius     NaN
117     NaN  NIG                  Niger     NaN
118     NaN  TOG                   Togo     NaN
119    17.0  PAR               Paraguay     NaN
120    14.0  PER                   Peru     1.0
121    14.0  SCG                 Serbia     NaN
122     4.0  NAM                Namibia     NaN
123     4.0  SIN              Singapore     NaN
124     2.0  HKG             Hong Kong*     1.0
125     2.0  SRI              Sri Lanka     NaN
126     2.0  TAN               Tanzania     NaN
127     2.0  VIE                Vietnam     NaN
128     1.0  ECU                Ecuador     1.0
129     1.0  LUX             Luxembourg     1.0
130     1.0  AHO  Netherlands Antilles*     NaN
131     1.0  CIV          Cote d'Ivoire     NaN
132     1.0  ISV        Virgin Islands*     NaN
133     1.0  SEN                Senegal     NaN
134     1.0  SUD                  Sudan     NaN
135     1.0  TGA                  Tonga     NaN
136     NaN  BDI                Burundi     1.0
137     NaN  UAE   United Arab Emirates     1.0

[138 rows x 9 columns]

## Resampling & concatenating DataFrames with inner join

In [138]:
#init
china = pd.read_csv(path+'china.csv',index_col='Year',parse_dates=True)
us = pd.read_csv(path+'usa.csv',index_col='Year',parse_dates=True)

china.head()
us.head()

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>US</th>
    </tr>
    <tr>
      <th>Year</th>
      <th></th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>1947-04-01</th>
      <td>246.3</td>
    </tr>
    <tr>
      <th>1947-07-01</th>
      <td>250.1</td>
    </tr>
    <tr>
      <th>1947-10-01</th>
      <td>260.3</td>
    </tr>
    <tr>
      <th>1948-01-01</th>
      <td>266.2</td>
    </tr>
    <tr>
      <th>1948-04-01</th>
      <td>272.9</td>
    </tr>
  </tbody>
</table>
</div>

In [ ]:
# Resample and tidy china: china_annual
china_annual = china.resample('A').pct_change(10).dropna()

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>China</th>
    </tr>
    <tr>
      <th>Year</th>
      <th></th>
    </tr>
  </thead>
  <tbody>
  </tbody>
</table>
</div>

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>China</th>
    </tr>
    <tr>
      <th>Year</th>
      <th></th>
    </tr>
  </thead>
  <tbody>
  </tbody>
</table>
</div>

In [ ]:


# Resample and tidy us: us_annual
us_annual = us.resample('A').pct_change(10).dropna()

# Concatenate china_annual and us_annual: gdp
gdp = pd.concat([china_annual,us_annual],axis=1,join='inner')

# Resample gdp and print
print(gdp.resample('10A').last())

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>China</th>
    </tr>
    <tr>
      <th>Year</th>
      <th></th>
    </tr>
  </thead>
  <tbody>
  </tbody>
</table>
</div>

## Merging on a specific column


This exercise follows on the last one with the DataFrames revenue and managers for your company. You expect your company to grow and, eventually, to operate in cities with the same name on different states. As such, you decide that every branch should have a numerical branch identifier. Thus, you add a branch_id column to both DataFrames. Moreover, new cities have been added to both the revenue and managers DataFrames as well. pandas has been imported as pd and both DataFrames are available in your namespace.

At present, there should be a 1-to-1 relationship between the city and branch_id fields. In that case, the result of a merge on the city columns ought to give you the same output as a merge on the branch_id columns. Do they? Can you spot an ambiguity in one of the DataFrames?

In [141]:
#init

In [ ]:
# Merge revenue with managers on 'city': merge_by_city
merge_by_city = ____

# Print merge_by_city
print(merge_by_city)

# Merge revenue with managers on 'branch_id': merge_by_id
merge_by_id = ____

# Print merge_by_id
print(merge_by_id)